In [1]:
import numpy as np
import pandas as pd

In [2]:
d1={'name':['manisha','mero','deeksha','x','y','w','r','p','m'],
    'age':[22,23,24,26,27,25,21,20,23],
    'class':['MCA','MBA','CSE','MEC','MCA','MCOM','BBA','BCA','BSC'],
    'marks':[90,90,90,89,76,86,74,87,88]}

In [3]:
d1

{'name': ['manisha', 'mero', 'deeksha', 'x', 'y', 'w', 'r', 'p', 'm'],
 'age': [22, 23, 24, 26, 27, 25, 21, 20, 23],
 'class': ['MCA', 'MBA', 'CSE', 'MEC', 'MCA', 'MCOM', 'BBA', 'BCA', 'BSC'],
 'marks': [90, 90, 90, 89, 76, 86, 74, 87, 88]}

In [4]:
df=pd.DataFrame(d1)

In [5]:
df

      name  age class  marks
0  manisha   22   MCA     90
1     mero   23   MBA     90
2  deeksha   24   CSE     90
3        x   26   MEC     89
4        y   27   MCA     76
5        w   25  MCOM     86
6        r   21   BBA     74
7        p   20   BCA     87
8        m   23   BSC     88

In [6]:
df["name"]

0    manisha
1       mero
2    deeksha
3          x
4          y
5          w
6          r
7          p
8          m
Name: name, dtype: object

In [7]:
df['class']

0     MCA
1     MBA
2     CSE
3     MEC
4     MCA
5    MCOM
6     BBA
7     BCA
8     BSC
Name: class, dtype: object

In [10]:
df.head(4)

      name  age class  marks
0  manisha   22   MCA     90
1     mero   23   MBA     90
2  deeksha   24   CSE     90
3        x   26   MEC     89

In [11]:
df.tail(2)

  name  age class  marks
7    p   20   BCA     87
8    m   23   BSC     88

In [12]:
df.to_csv('student.csv')

In [13]:
df.describe()

             age      marks
count   9.000000   9.000000
mean   23.444444  85.555556
std     2.297341   6.166667
min    20.000000  74.000000
25%    22.000000  86.000000
50%    23.000000  88.000000
75%    25.000000  90.000000
max    27.000000  90.000000

In [15]:
df

      name  age class  marks
0  manisha   22   MCA     90
1     mero   23   MBA     90
2  deeksha   24   CSE     90
3        x   26   MEC     89
4        y   27   MCA     76
5        w   25  MCOM     86
6        r   21   BBA     74
7        p   20   BCA     87
8        m   23   BSC     88

In [19]:
newdf = pd.read_csv("std.csv")

In [20]:
newdf

      name  age class  marks
0  manisha   22   MCA   88.0
1  Merolin   23   CSE   89.0
2  Deeksha   23   MCA   90.0
3     Arun   20   BBA    NaN
4   Ramesh   25   BSC   92.0

In [21]:
newdf.dtypes

name      object
age        int64
class     object
marks    float64
dtype: object

In [22]:
type(newdf)

pandas.core.frame.DataFrame

In [23]:
newdf.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
newdf.columns

Index(['name', 'age', 'class', 'marks'], dtype='object')

In [25]:
newdf.T

             0        1        2     3       4
name   manisha  Merolin  Deeksha  Arun  Ramesh
age         22       23       23    20      25
class      MCA      CSE      MCA   BBA     BSC
marks     88.0     89.0     90.0   NaN    92.0

In [26]:
newdf.sort_index(axis=0,ascending=False)

      name  age class  marks
4   Ramesh   25   BSC   92.0
3     Arun   20   BBA    NaN
2  Deeksha   23   MCA   90.0
1  Merolin   23   CSE   89.0
0  manisha   22   MCA   88.0

In [35]:
newdf.loc[3,'marks']=89

In [36]:
newdf

      name  age class  marks     0
0  manisha   22   MCA   88.0  89.0
1  Merolin   23   CSE   89.0   NaN
2  Deeksha   23   MCA   90.0   NaN
3     Arun   20   BBA   89.0   NaN
4   Ramesh   25   BSC   92.0   NaN

In [38]:
newdf

      name  age class  marks     0
0  manisha   22   MCA   88.0  89.0
1  Merolin   23   CSE   89.0   NaN
2  Deeksha   23   MCA   90.0   NaN
3     Arun   20   BBA   89.0   NaN
4   Ramesh   25   BSC   92.0   NaN